{
    "last_update": "08.09.2020",
    "home":{
        "project_description": "<p>Recent achievements in Deep Learning and its successful practical adoption in a variety of applications suggest that it can also be applied for predicting equipment outages. In production and logistics, which are the application fields of COGNITUS, the need for novel, more effective learning techniques is clearly motivated by the fact that maintenance costs account for between 15% and 40% of total cost. However, three key issues currently prevent Deep Learning techniques from being deployed in real world settings: they lack explainability, it is unclear how to consider algorithmic predictions in maintenance processes and decisions, and pilot studies based on real-world industry datasets are still scarce.</p><p>Therefore, the <b>goal of COGNITUS</b> is to provide a Deep Learning pipeline equipped with a set of generic algorithmic building blocks for predicting outages of machineries based on sensor data streams. It will implement those building blocks for two distinct real-world use cases and predict outages of jewelry production equipment (<a href=\"https://www.swarovski.com/\" target=\"_blank\">Swarovski</a>), and warehousing equipment in logistics (<a href=\"https://www.spar.at/\" target=\"_blank\">SPAR</a>). Orthogonally, COGNITUS will investigate, develop and validate novel data-driven maintenance strategies, which support decision making based on algorithmic predictions. </p><p>The <b>expected results</b> of COGNITUS are: <ul><li>data-driven maintenance and decision support models considering algorithmic predictions in decision making, </li><li>data analytics and visualization algorithms operating on-top of data streams, </li><li>software libraries supporting training and evaluation of Deep Learning based outage prediction models and providing explainability of model behaviors and predictions, and </li><li>two proof-of-concepts in the fields of production and logistics, which allow assessment and quantification of benefits on the operational and business level.</li></ul> </p>"
    },
    "partners": [{
            "name": "Austrian Institute of Technology GmbH",
            "link": "https://www.ait.ac.at/",
            "text": "The AIT Austrian Institute of Technology is Austria’s largest research and technology organisation. Among the European research institutes, AIT is a specialist in the key infrastructure issues of the future. AIT’s Digital Insight Lab (DIL) provides data science consulting and solutions for making informed decisions based on large, heterogeneous, and real-time data under strict conditions of IT security and data protection. The DIL is a multidisciplinary group of experienced scientists and engineers with diverse backgrounds - from data analytics, applied mathematics and statistics, to information security, and the humanities.",
            "logo": "ait_logo.jpg"
        },
        {
            "name": "Fraunhofer Austria Research GmbH",
            "link": "https://www.fraunhofer.at/",
            "text": "Fraunhofer Austria Research GmbH (FhA) is a wholly owned subsidiary of the German Fraunhofer-Gesellschaft (FhG) with three locations in Austria: Production and Logistics Management in Vienna, Visual Computing located in Graz and an innovation center for digital transformation of the industry in Wattens in Tyrol. FhA has expertise on analyzing and optimizing production and logistics processes in a highly automated environment, physically-based simulation, and the development and design of planning models and decision support models. The group has the appropriate infrastructure and intellectual framework in order to solve and implement sophisticated solutions in the field of maintenance and production planning. Various process optimizations are implemented on a regular basis.",
            "logo": "fraunhofer.png"
        },
        {
            "name": "LineMetrics GmbH",
            "link": "https://www.linemetrics.com/",
            "text": "LineMetrics provides a leading “Industrial IoT” solution which makes it easy for companies to monitor their assets. It provides a full stack of hardware devices for data acquisition, covers global data communication (GSM), offers a whole range of software for different interfaces and hosts a cloud service to store, process and analyze the sensor / asset data. To enable small and mid-sized companies to monitor their assets without any investment costs, the complete LineMetrics solution is to be provided “as a Service”.",
            "logo": "lm-logo-small-2.png"
        },
        {
            "name": "SPAR Österreichische Warenhandels-AG",
            "link": "https://www.spar.at",
            "text": "SPAR Austria is a 100% private, family-owned retailer. With more than 44.700 employees it is Austria’s largest employer with a yearly turnover of 6,88 billion (dt. Milliarden) Euros. With its neighboring countries in Italy, Slovenia, Hungary, and Croatia, SPAR Austria now employs more than 82.700 people. <br>SPAR currently supplies more than 1.600 supermarket locations in Austria. A sophisticated logistics infrastructure ensures that goods arrive at the right place at the right time.",
            "logo": "spar-logo.jpg"
        },
        {
            "name": "Swarovski",
            "link": "https://www.swarovski.com",
            "text": "Swarovski is the world’s leading manufacturer of premium crystal components, providing finest crystals since 1895. With more than a hundred and twenty years’ experience of high-quality craftsmanship and mastery in cutting, Swarovski produces light-filled crystals of outstanding range and brilliance. Swarovski means access to 15,000 loose crystals and another 400,000 forward-integrated elements. Apart from the main manufacturing site in Wattens (Austria) Swarovski operates a worldwide marketing, sales and distribution network. Research, Development and Innovation form the constitutive basis for future growth of the Swarovski Group covering a wide range of R&D topics from glass engineering, over light & optical engineering, glass cutting and polishing to refinement technologies (such as PVD, CVD, sputtering, wet chemical coating, lacquering) as well as electronic automation development. The production site in Wattens covers all value chain steps for the manufacturing of crystal components as well as the project relevant departments: Technical Development, Applied Research, IT, Industrial Engineering, Quality Inspection, Maintenance andProduction units.",
            "logo": "swarovski.png"
        }
    ],
    "results": [
        "to be announced"
        // "Kalodner, H., Möser, M., Lee, K., Goldfeder, S., Plattner, M., Chator, A., Narayanan, A.,: <a href=\"https://www.usenix.org/conference/usenixsecurity20/presentation/kalodner\">\"BlockSci: Design and applications of a blockchain analysis platform\"</a>, USENIX Security 2020",
        // "Hospes, J., Hötzendorfer, W., Tschohl, C., Kastelitz, M.: <a href=\"https://jusletter-it.weblaw.ch/issues/2020/IRIS.html\">\"Kryptowährungen im Finanzmarktrecht und grundrechtliche Grenzen von Verboten\"</a>, In: Schweighofer, E., Kummer, F., Saarenpää, A., Hötzendorfer, W. (Hrsg.): “Verantwortungsbewusste Digitalisierung”, Tagungsband des 23. Internationalen Rechtsinformatik Symposions 2020, Editions Weblaw, Bern, 2020, 569 – 576, LexisNexis Best Paper Award Top-10-Paper des IRIS 2020"
    ]
}